# Vypr√°v√≠me p≈ô√≠bƒõh s daty

## Sezn√°men√≠ s daty

## Pandas üêº

### Nas≈•a a Filip Sedl√°kovi

## Sezn√°men√≠ s daty - postup

1. Naƒç√≠st data
    - P≈ô√≠padnƒõ p≈ôejmenovat sloupce

2. V jak√©m form√°tu jsou sloupce?

3. Kolik je ≈ô√°dk≈Ø a sloupc≈Ø?

4. Obsahuj√≠ nƒõkter√© sloupce chybƒõj√≠c√≠ data?

5. Udƒõlat popisnou statistiku dat

## Co je pandas?

- Knihovna pro anal√Ωzu dat v Pythonu
- Je postavena na NumPy (knihovna pro pr√°ci s numerick√Ωmi daty)
- [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/10min.html)

## Jak naimportuji pandas?

In [1]:
# Importujeme pandas jako zkr√°tku
# Nen√≠ to nutn√©, ale vƒõt≈°ina tutorialu to tak m√°
import pandas as pd

## Jak naƒçtu data?

Pandas m√° nƒõkolik funkc√≠, tady je [hezk√Ω](https://pandas.pydata.org/pandas-docs/stable/cookbook.html#data-in-out) p≈ôehled

Nejpou≈æ√≠vanƒõj≈°√≠ je funkce [`read_csv`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html), kter√° m√° v√≠ce ne≈æ 20 parametr≈Ø (nebojte se, jenom jeden parametr je povinn√Ω üôÇ)

In [2]:
data = pd.read_csv('http://vincentarelbundock.github.io/Rdatasets/csv/DAAG/primates.csv')
data.head()

      Unnamed: 0  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

In [3]:
data = pd.read_csv('primates.csv')
data.head()

      Unnamed: 0  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

In [4]:
# Zobraz√≠me index tabulky
data.index

RangeIndex(start=0, stop=5, step=1)

## Cviƒçen√≠
 
Naƒçtƒõte data `tips.csv` (jsou ve stejn√© slo≈æce) a pou≈æijte prvn√≠ sloupec jako index

**Bonus**: Naƒçtete [data z UNICEF](https://data.unicef.org/wp-content/uploads/2015/12/Out-of-School-Rate-Final-for-website.xlsx) pomoc√≠ `read_excel` funkce z pandas a p≈ôeskoƒçte prvn√≠ch 9 ≈ô√°dk≈Ø

## Jak p≈ôejmenuji sloupce?

In [5]:
# Zobraz√≠me n√°zvy sloupc≈Ø
data.columns

Index(['Unnamed: 0', 'Bodywt', 'Brainwt'], dtype='object')

In [6]:
# inplace=True znamen√°, ≈æe se pozmƒõn√≠ souƒçasn√° tabulka
data.rename(index=str, columns={'Unnamed: 0': 'Species'}, inplace=True)
data

         Species  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

## Cviƒçen√≠
 
1. Naƒçtƒõte data `titanic3.xls` pomoc√≠ `read_excel` funkce z pandas
2. P≈ôejmenujte sloupec `pclass` na `passenger_class` a `home.dest` na `home_destination`

## Jak zjist√≠m, v jak√©m form√°tu jsou sloupce?

In [3]:
data.dtypes

Unnamed: 0     object
Bodywt        float64
Brainwt         int64
dtype: object

## Jak zjist√≠m, kolik m√° tabulk√° ≈ô√°d≈Ø a sloupc≈Ø?

In [7]:
# Poƒçet ≈ô√°dk≈Ø a poƒçet sloupc≈Ø
data.shape

(5, 3)

In [8]:
# Poƒçet ≈ô√°dk≈Ø
data.shape[0]

5

In [9]:
# Poƒçet ≈ô√°dk≈Ø
len(data)

5

## Cviƒçen√≠
 
1. Naƒçtƒõte data `titanic3.xls` pomoc√≠ `read_excel` funkce z pandas
2. Zjistƒõte poƒçet ≈ô√°dk≈Ø (spr√°vn√° odpovƒõƒè je 1309)
3. Zjistƒõte poƒçet sloupc≈Ø (spr√°vn√° odpovƒõƒè je 14)

## Jak zjist√≠m, zda v tabulce jsou chybƒõj√≠c√≠ data?

In [10]:
# Naƒçteme data z Excelu
data = pd.read_excel('titanic3.xls')
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [11]:
# Jak√© sloupce m√° tabulka?
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [12]:
# M√° tabulk√° chybƒõj√≠c√≠ data?
data.isnull().values.any()

True

In [13]:
# Zjist√≠me, kter√© sloupce maj√≠ chybƒõj√≠c√≠ data
data.isnull().any()

pclass       False
survived     False
name         False
sex          False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

## Cviƒçen√≠
 
1. Naƒçtƒõte data `titanic`
2. Zjistƒõte, kter√© sloupce maj√≠ chybaj√≠c√≠ data (spr√°vn√° odpovƒõƒè Sleep, Sleep7, SmokeLife, SmokeDaily, MarijuaEver)

**Bonus**: Zjistƒõte kol√≠k ≈ô√°dk≈Ø m√° chybƒõj√≠c√≠ data (spr√°vn√° odpovƒõƒè je 72)

## Jak vyberu ≈ô√°dky a sloupce?

Pandas m√° 2 zp≈Øsoby:
- `iloc` vyb√≠r√° podle pozic (index≈Ø)
    - stejnƒõ jako kdy≈æ vyb√≠r√°m ze seznamu
    - bez koncov√©ho indexu
- `loc` vyb√≠r√° podle jmen
    - vƒçetnƒõ koncov√©ho indexu

In [14]:
# Naƒçteme data
data = pd.read_csv('primates.csv')
data.rename(index=str, columns={'Unnamed: 0': 'Species'}, inplace=True)
data.head()

         Species  Bodywt  Brainwt
0   Potar monkey    10.0      115
1        Gorilla   207.0      406
2          Human    62.0     1320
3  Rhesus monkey     6.8      179
4          Chimp    52.2      440

In [15]:
# Vybereme 0. a 1. ≈ô√°dky
data.iloc[0:2]

        Species  Bodywt  Brainwt
0  Potar monkey    10.0      115
1       Gorilla   207.0      406

In [16]:
# Vybereme 0. a 1. ≈ô√°dky a 1. a 2. sloupce
data.iloc[0:2, 1:3]

   Bodywt  Brainwt
0    10.0      115
1   207.0      406

In [17]:
# Vyb√≠r√°me podle jm√©na
# POZOR: ƒç√≠seln√Ω index mus√≠ b√Ωt p≈ôeveden ≈ôetƒõzec
data.loc['1':'2', ['Species', 'Bodywt']]

   Species  Bodywt
1  Gorilla   207.0
2    Human    62.0

In [18]:
# Vybereme sloupec
data.Bodywt

0     10.0
1    207.0
2     62.0
3      6.8
4     52.2
Name: Bodywt, dtype: float64

In [19]:
# Vybereme sloupec - druhy zp≈Øsob
data['Bodywt']

0     10.0
1    207.0
2     62.0
3      6.8
4     52.2
Name: Bodywt, dtype: float64

In [20]:
# Lze specifikovat, kter√Ω sloupec je index
# Index se v tomto p≈ô√≠padƒõ skl√°d√° z ≈ôetƒõzc≈Ø
data = pd.read_csv(
    'primates.csv', 
    index_col=0
)
data.head()

               Bodywt  Brainwt
Potar monkey     10.0      115
Gorilla         207.0      406
Human            62.0     1320
Rhesus monkey     6.8      179
Chimp            52.2      440

In [21]:
data.loc['Potar monkey']

Bodywt      10.0
Brainwt    115.0
Name: Potar monkey, dtype: float64

## Cviƒçen√≠
 
1. Naƒçtƒõte data `titanic`
2. Vyberte prvn√≠ch 20 ≈ô√°dk≈Ø
3. Vyberte prvn√≠ch 20 ≈ô√°dk≈Ø a sloupec se jm√©nem (`name`)

**Bonus**: Vyberte ≈ô√°dky 10 a≈æ 550 a n√°sleduj√≠c√≠ sloupce: jm√©no (`name`), cena j√≠zdenky (`fare`), zda osoba p≈ôe≈æila (`survived`)

## Jak vyberu ≈ô√°dky, kter√© spl≈àuj√≠ urƒçitou podm√≠nku?

`data[podm√≠nka]`

`data[(podm√≠nka1) & (podm√≠nka2)]`

In [22]:
data.columns

Index(['Bodywt', 'Brainwt'], dtype='object')

In [23]:
data.Bodywt > 60

Potar monkey     False
Gorilla           True
Human             True
Rhesus monkey    False
Chimp            False
Name: Bodywt, dtype: bool

In [24]:
# Vyber√©me ≈ô√°dky, kde tƒõlƒõsn√° hmota je v√≠ce ne≈æ 60
data[data.Bodywt > 60]

         Bodywt  Brainwt
Gorilla   207.0      406
Human      62.0     1320

In [25]:
# Vyber√©me ≈ô√°dky, kde je tƒõlƒõsn√° hmota v√≠ce ne≈æ 60 a hmota mozku je m√©nƒõ ne≈æ 500
data[(data.Bodywt > 60) & (data.Brainwt < 500)]

         Bodywt  Brainwt
Gorilla   207.0      406

 ## Cviƒçen√≠
 
1. Naƒçtƒõte data `titanic`
2. Vyberte ≈ô√°dky cestuj√≠c√≠ch ≈æensk√©ho pohlav√≠ a spoƒç√≠tejte je (spr√°vn√° odpovƒõƒè je 466)
3. Vyberte ≈ô√°dky cestuj√≠c√≠ch ≈æensk√©ho pohlav√≠, kter√© jsou star≈°√≠ 1 roku a spoƒç√≠tejte je (spr√°vn√° odpovƒõƒè je 379)

**Bonus**: Pro vybran√© ≈ô√°dky spoƒç√≠tejte pr≈Ømƒõrnou cenu j√≠zdenky (`fare`) (spr√°vn√° odpovƒõƒè je cca 51)

## Jak seskup√≠m ≈ô√°dky?

Pou≈æijeme metodu `groupby`, kter√° seskup√≠ ≈ô√°dky dle jednoho nebo v√≠ce sloupc≈Ø.

Potom pou≈æijeme nƒõjakou metodu nad seskupen√Ωmi ≈ô√°dky (`count`, `mean`, `sum`).

In [26]:
# Naƒçteme data z Excelu
data = pd.read_excel('titanic3.xls')
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [27]:
# Groupby vrac√≠ iter√°tor
data.groupby('sex')

In [28]:
# Seskup√≠me ≈ô√°dky dle pohlav√≠ a spoƒç√≠t√°me pr≈Ømƒõrnou hodnotu v≈°ech ƒç√≠seln√Ωch promƒõnn√Ωch
data.groupby('sex').mean()

,pclass,survived,age,sibsp,parch,fare,body
sex,,,,,,,
female,2.154506,0.727468,28.687071,0.652361,0.633047,46.198097,166.62500
male,2.372479,0.190985,30.585233,0.413998,0.247924,26.154601,160.39823

In [29]:
# Tot√©≈æ m≈Ø≈æeme udƒõlat pomoc√≠ filtrov√°n√≠
data[data.sex == 'female'].mean()

pclass        2.154506
survived      0.727468
age          28.687071
sibsp         0.652361
parch         0.633047
fare         46.198097
body        166.625000
dtype: float64

In [30]:
data[data.sex == 'male'].mean()

pclass        2.372479
survived      0.190985
age          30.585233
sibsp         0.413998
parch         0.247924
fare         26.154601
body        160.398230
dtype: float64

In [31]:
# Seskupen√≠ dle v√≠ce promƒõnn√Ωch - pohlav√≠ a m√≠sta nalodƒõn√≠
data.groupby(['sex', 'embarked']).mean()

                   pclass  survived        age     sibsp     parch       fare  \
sex    embarked
female C         1.646018  0.902655  31.224490  0.504425  0.513274  81.128540
       Q         2.900000  0.616667  25.458333  0.200000  0.133333  12.550837
       S         2.206186  0.680412  27.877210  0.807560  0.786942  39.339305
male   C         2.000000  0.305732  33.284357  0.324841  0.267516  48.810619
       Q         2.888889  0.111111  31.557692  0.476190  0.095238  12.273941
       S         2.414125  0.170144  29.942407  0.430177  0.258427  21.841878

                       body
sex    embarked
female C         328.000000
       Q         229.000000
       S          79.500000
male   C         155.083333
       Q         134.750000
       S         163.105882

 ## Cviƒçen√≠

Seskupte `titanic` dle t≈ô√≠dy (`pclass`) a pohlav√≠ (`sex`) zobrazte medi√°n (`median`)

**Bonus**: zobrazte jenom sloupec vƒõk (`age`)

## Jak uka≈æu popisnou statistiku pro v≈°echny sloupce?

In [5]:
# Bez include='all' jenom numerick√© sloupce
data.describe(include='all')

           Unnamed: 0      Bodywt      Brainwt
count               5    5.000000     5.000000
unique              5         NaN          NaN
top     Rhesus monkey         NaN          NaN
freq                1         NaN          NaN
mean              NaN   67.600000   492.000000
std               NaN   81.724048   483.679129
min               NaN    6.800000   115.000000
25%               NaN   10.000000   179.000000
50%               NaN   52.200000   406.000000
75%               NaN   62.000000   440.000000
max               NaN  207.000000  1320.000000

## Cviƒçen√≠

Pou≈æijte n√°sleduj√≠c√≠ postup a seznamte se s [tƒõmito daty](http://vincentarelbundock.github.io/Rdatasets/csv/robustbase/education.csv), [popis dat](http://vincentarelbundock.github.io/Rdatasets/doc/robustbase/education.html)


1. Naƒç√≠st data
    - P≈ô√≠padnƒõ p≈ôejmenovat sloupce

2. V jak√©m form√°tu jsou sloupce?

3. Kolik je ≈ô√°dk≈Ø a sloupc≈Ø?

4. Obsahuj√≠ nƒõkter√© sloupce chybƒõj√≠c√≠ data?

5. Udƒõlat popisnou statistiku dat